# main.py
# ===============================
# module을 import 해서 사용하는 파일
# ===============================

# 모듈 import
import module
# 아래 처럼 쓰면 일일히 module을 쓸 필요가 없어짐
# ex) obj = module.Test() 이런 문법이, obj = Test() 이렇게 간소화 됨
# ⭐⭐⭐
# module이라는 파일명을 가진 것에서부터 Test, say_hello, add를 가져오겠다.
# from module import Test, say_hello, add

print("📌 main.py 실행 시작")

# -------------------------------
# 클래스 사용
# -------------------------------
obj = module.Test()   # 이때 __init__ 실행됨
obj.hello()

# -------------------------------
# 함수 사용
# -------------------------------
module.say_hello()

result = module.add(10, 20)
print("add 결과:", result)
